package com.company;

public class Main {

    public static void main(String[] args) throws Exception {

    }
    public static void showAction(){
        System.out.println("\n" +
                "Открыть соединение с базой данных\n" +
                "Закрыть соединение с базой данных\n" +
                "Проверить есть ли соединение с базой\n" +
                "Считать одну запись (строку) по индексу\n" +
                "Проверить есть ли запись по такому-то ключу\n" +
                "Считать одну запись по ключу\n" +
                "Считать из базы некоторый набор записей.\n" +
                "Узнать количество записей в базе\n" +
                "Добавить запись в базу\n" +
                "Обновить значение записи по индексу\n" +
                "Обновить содержимое записи по ключу");
    }
}

